HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxLmu_reg.h
/**
 * \file IfxLmu_reg.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC35XA_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg Lmu address
 * \ingroup IfxSfr_Lmu_Registers
 * 
 * \defgroup IfxSfr_Lmu_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg_Lmu0 2-LMU0
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 * \defgroup IfxSfr_Lmu_Registers_Cfg_Lmu1 2-LMU1
 * \ingroup IfxSfr_Lmu_Registers_Cfg
 *
 *
 */
#ifndef IFXLMU_REG_H
#define IFXLMU_REG_H 1
/******************************************************************************/
#include "IfxLmu_regdef.h"
/******************************************************************************/

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Lmu_Registers_Cfg_BaseAddress
 * \{  */

/** \brief LMU object */
#define MODULE_LMU0 /*lint --e(923, 9078)*/ ((*(Ifx_LMU*)0xF8100000u))
#define MODULE_LMU1 /*lint --e(923, 9078)*/ ((*(Ifx_LMU*)0xF8110000u))
/** \}  */


/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Lmu_Registers_Cfg_Lmu0
 * \{  */
/** \brief 0, LMU Clock Control Register */
#define LMU0_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_CLC*)0xF8100000u)

/** \brief 8, LMU Module ID Register */
#define LMU0_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MODID*)0xF8100008u)

/** \brief 10, LMU Access Enable Register 0 */
#define LMU0_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN0*)0xF8100010u)

/** \brief 14, LMU Access Enable Register 1 */
#define LMU0_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_ACCEN1*)0xF8100014u)

/** \brief 20, LMU Memory Control Register */
#define LMU0_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_MEMCON*)0xF8100020u)

/** \brief 24, LMU Safety Control Register */
#define LMU0_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_SCTRL*)0xF8100024u)

/** \brief 50, LMU Region Lower Address Register */
#define LMU0_RGN0_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100050u)
/** Alias (User Manual Name) for LMU0_RGN0_LA.
* To use register names with standard convension, please use LMU0_RGN0_LA.
*/
#define LMU0_RGNLA0 (LMU0_RGN0_LA)

/** \brief 54, LMU Region Upper Address Register */
#define LMU0_RGN0_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100054u)
/** Alias (User Manual Name) for LMU0_RGN0_UA.
* To use register names with standard convension, please use LMU0_RGN0_UA.
*/
#define LMU0_RGNUA0 (LMU0_RGN0_UA)

/** \brief 58, LMU Region Write Access Enable Register A */
#define LMU0_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100058u)
/** Alias (User Manual Name) for LMU0_RGN0_ACCENA.
* To use register names with standard convension, please use LMU0_RGN0_ACCENA.
*/
#define LMU0_RGNACCENWA0 (LMU0_RGN0_ACCENA)

/** \brief 5C, LMU Region Write Access Enable Register B */
#define LMU0_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810005Cu)
/** Alias (User Manual Name) for LMU0_RGN0_ACCENB.
* To use register names with standard convension, please use LMU0_RGN0_ACCENB.
*/
#define LMU0_RGNACCENWB0 (LMU0_RGN0_ACCENB)

/** \brief 60, LMU Region Lower Address Register */
#define LMU0_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100060u)
/** Alias (User Manual Name) for LMU0_RGN1_LA.
* To use register names with standard convension, please use LMU0_RGN1_LA.
*/
#define LMU0_RGNLA1 (LMU0_RGN1_LA)

/** \brief 64, LMU Region Upper Address Register */
#define LMU0_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100064u)
/** Alias (User Manual Name) for LMU0_RGN1_UA.
* To use register names with standard convension, please use LMU0_RGN1_UA.
*/
#define LMU0_RGNUA1 (LMU0_RGN1_UA)

/** \brief 68, LMU Region Write Access Enable Register A */
#define LMU0_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100068u)
/** Alias (User Manual Name) for LMU0_RGN1_ACCENA.
* To use register names with standard convension, please use LMU0_RGN1_ACCENA.
*/
#define LMU0_RGNACCENWA1 (LMU0_RGN1_ACCENA)

/** \brief 6C, LMU Region Write Access Enable Register B */
#define LMU0_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810006Cu)
/** Alias (User Manual Name) for LMU0_RGN1_ACCENB.
* To use register names with standard convension, please use LMU0_RGN1_ACCENB.
*/
#define LMU0_RGNACCENWB1 (LMU0_RGN1_ACCENB)

/** \brief 70, LMU Region Lower Address Register */
#define LMU0_RGN2_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_LA*)0xF8100070u)
/** Alias (User Manual Name) for LMU0_RGN2_LA.
* To use register names with standard convension, please use LMU0_RGN2_LA.
*/
#define LMU0_RGNLA2 (LMU0_RGN2_LA)

/** \brief 74, LMU Region Upper Address Register */
#define LMU0_RGN2_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_UA*)0xF8100074u)
/** Alias (User Manual Name) for LMU0_RGN2_UA.
* To use register names with standard convension, please use LMU0_RGN2_UA.
*/
#define LMU0_RGNUA2 (LMU0_RGN2_UA)

/** \brief 78, LMU Region Write Access Enable Register A */
#define LMU0_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENA*)0xF8100078u)
/** Alias (User Manual Name) for LMU0_RGN2_ACCENA.
* To use register names with standard convension, please use LMU0_RGN2_ACCENA.
*/
#define LMU0_RGNACCENWA2 (LMU0_RGN2_ACCENA)

/** \brief 7C, LMU Region Write Access Enable Register B */
#define LMU0_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810007Cu)
/** Alias (User Manual Name) for LMU0_RGN2_ACCENB.
* To use register names with standard convension, please use LMU0_RGN2_ACCENB.
*/
#define LMU0_RGNACCENWB2 (LMU0_RGN2_ACCENB)

