HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxLmu_reg.h
/** \brief 14C, LMU Region Write Access Enable Register B */
#define LMU0_RGN15_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF810014Cu)
/** Alias (User Manual Name) for LMU0_RGN15_ACCENB.
* To use register names with standard convension, please use LMU0_RGN15_ACCENB.
*/
#define LMU0_RGNACCENWB15 (LMU0_RGN15_ACCENB)

/** \brief 158, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN0_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100158u)
/** Alias (User Manual Name) for LMU0_RGNACCEN0_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN0_RA.
*/
#define LMU0_RGNACCENRA0 (LMU0_RGNACCEN0_RA)

/** \brief 15C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN0_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810015Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN0_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN0_RB.
*/
#define LMU0_RGNACCENRB0 (LMU0_RGNACCEN0_RB)

/** \brief 168, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN1_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100168u)
/** Alias (User Manual Name) for LMU0_RGNACCEN1_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN1_RA.
*/
#define LMU0_RGNACCENRA1 (LMU0_RGNACCEN1_RA)

/** \brief 16C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN1_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810016Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN1_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN1_RB.
*/
#define LMU0_RGNACCENRB1 (LMU0_RGNACCEN1_RB)

/** \brief 178, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN2_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100178u)
/** Alias (User Manual Name) for LMU0_RGNACCEN2_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN2_RA.
*/
#define LMU0_RGNACCENRA2 (LMU0_RGNACCEN2_RA)

/** \brief 17C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN2_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810017Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN2_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN2_RB.
*/
#define LMU0_RGNACCENRB2 (LMU0_RGNACCEN2_RB)

/** \brief 188, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN3_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100188u)
/** Alias (User Manual Name) for LMU0_RGNACCEN3_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN3_RA.
*/
#define LMU0_RGNACCENRA3 (LMU0_RGNACCEN3_RA)

/** \brief 18C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN3_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810018Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN3_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN3_RB.
*/
#define LMU0_RGNACCENRB3 (LMU0_RGNACCEN3_RB)

/** \brief 198, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN4_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8100198u)
/** Alias (User Manual Name) for LMU0_RGNACCEN4_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN4_RA.
*/
#define LMU0_RGNACCENRA4 (LMU0_RGNACCEN4_RA)

/** \brief 19C, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN4_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF810019Cu)
/** Alias (User Manual Name) for LMU0_RGNACCEN4_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN4_RB.
*/
#define LMU0_RGNACCENRB4 (LMU0_RGNACCEN4_RB)

/** \brief 1A8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN5_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001A8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN5_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN5_RA.
*/
#define LMU0_RGNACCENRA5 (LMU0_RGNACCEN5_RA)

/** \brief 1AC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN5_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001ACu)
/** Alias (User Manual Name) for LMU0_RGNACCEN5_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN5_RB.
*/
#define LMU0_RGNACCENRB5 (LMU0_RGNACCEN5_RB)

/** \brief 1B8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN6_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001B8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN6_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN6_RA.
*/
#define LMU0_RGNACCENRA6 (LMU0_RGNACCEN6_RA)

/** \brief 1BC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN6_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001BCu)
/** Alias (User Manual Name) for LMU0_RGNACCEN6_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN6_RB.
*/
#define LMU0_RGNACCENRB6 (LMU0_RGNACCEN6_RB)

/** \brief 1C8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN7_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001C8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN7_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN7_RA.
*/
#define LMU0_RGNACCENRA7 (LMU0_RGNACCEN7_RA)

/** \brief 1CC, LMU Region Read Access Enable Register B */
#define LMU0_RGNACCEN7_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81001CCu)
/** Alias (User Manual Name) for LMU0_RGNACCEN7_RB.
* To use register names with standard convension, please use LMU0_RGNACCEN7_RB.
*/
#define LMU0_RGNACCENRB7 (LMU0_RGNACCEN7_RB)

/** \brief 1D8, LMU Region Read Access Enable Register A */
#define LMU0_RGNACCEN8_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81001D8u)
/** Alias (User Manual Name) for LMU0_RGNACCEN8_RA.
* To use register names with standard convension, please use LMU0_RGNACCEN8_RA.
*/
#define LMU0_RGNACCENRA8 (LMU0_RGNACCEN8_RA)

