HAMES2-1st-3/TunnelComfortSystemTesting/include/tc35xa/IfxLmu_reg.h
/** \brief 14C, LMU Region Write Access Enable Register B */
#define LMU1_RGN15_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGN_ACCENB*)0xF811014Cu)
/** Alias (User Manual Name) for LMU1_RGN15_ACCENB.
* To use register names with standard convension, please use LMU1_RGN15_ACCENB.
*/
#define LMU1_RGNACCENWB15 (LMU1_RGN15_ACCENB)

/** \brief 158, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN0_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110158u)
/** Alias (User Manual Name) for LMU1_RGNACCEN0_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN0_RA.
*/
#define LMU1_RGNACCENRA0 (LMU1_RGNACCEN0_RA)

/** \brief 15C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN0_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811015Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN0_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN0_RB.
*/
#define LMU1_RGNACCENRB0 (LMU1_RGNACCEN0_RB)

/** \brief 168, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN1_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110168u)
/** Alias (User Manual Name) for LMU1_RGNACCEN1_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN1_RA.
*/
#define LMU1_RGNACCENRA1 (LMU1_RGNACCEN1_RA)

/** \brief 16C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN1_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811016Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN1_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN1_RB.
*/
#define LMU1_RGNACCENRB1 (LMU1_RGNACCEN1_RB)

/** \brief 178, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN2_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110178u)
/** Alias (User Manual Name) for LMU1_RGNACCEN2_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN2_RA.
*/
#define LMU1_RGNACCENRA2 (LMU1_RGNACCEN2_RA)

/** \brief 17C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN2_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811017Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN2_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN2_RB.
*/
#define LMU1_RGNACCENRB2 (LMU1_RGNACCEN2_RB)

/** \brief 188, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN3_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110188u)
/** Alias (User Manual Name) for LMU1_RGNACCEN3_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN3_RA.
*/
#define LMU1_RGNACCENRA3 (LMU1_RGNACCEN3_RA)

/** \brief 18C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN3_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811018Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN3_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN3_RB.
*/
#define LMU1_RGNACCENRB3 (LMU1_RGNACCEN3_RB)

/** \brief 198, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN4_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF8110198u)
/** Alias (User Manual Name) for LMU1_RGNACCEN4_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN4_RA.
*/
#define LMU1_RGNACCENRA4 (LMU1_RGNACCEN4_RA)

/** \brief 19C, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN4_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF811019Cu)
/** Alias (User Manual Name) for LMU1_RGNACCEN4_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN4_RB.
*/
#define LMU1_RGNACCENRB4 (LMU1_RGNACCEN4_RB)

/** \brief 1A8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN5_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101A8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN5_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN5_RA.
*/
#define LMU1_RGNACCENRA5 (LMU1_RGNACCEN5_RA)

/** \brief 1AC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN5_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101ACu)
/** Alias (User Manual Name) for LMU1_RGNACCEN5_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN5_RB.
*/
#define LMU1_RGNACCENRB5 (LMU1_RGNACCEN5_RB)

/** \brief 1B8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN6_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101B8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN6_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN6_RA.
*/
#define LMU1_RGNACCENRA6 (LMU1_RGNACCEN6_RA)

/** \brief 1BC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN6_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101BCu)
/** Alias (User Manual Name) for LMU1_RGNACCEN6_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN6_RB.
*/
#define LMU1_RGNACCENRB6 (LMU1_RGNACCEN6_RB)

/** \brief 1C8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN7_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101C8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN7_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN7_RA.
*/
#define LMU1_RGNACCENRA7 (LMU1_RGNACCEN7_RA)

/** \brief 1CC, LMU Region Read Access Enable Register B */
#define LMU1_RGNACCEN7_RB /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RB*)0xF81101CCu)
/** Alias (User Manual Name) for LMU1_RGNACCEN7_RB.
* To use register names with standard convension, please use LMU1_RGNACCEN7_RB.
*/
#define LMU1_RGNACCENRB7 (LMU1_RGNACCEN7_RB)

/** \brief 1D8, LMU Region Read Access Enable Register A */
#define LMU1_RGNACCEN8_RA /*lint --e(923, 9078)*/ (*(volatile Ifx_LMU_RGNACCEN_RA*)0xF81101D8u)
/** Alias (User Manual Name) for LMU1_RGNACCEN8_RA.
* To use register names with standard convension, please use LMU1_RGNACCEN8_RA.
*/
#define LMU1_RGNACCENRA8 (LMU1_RGNACCEN8_RA)

